{
  "navigation": [
    { "id": "fourth-year", "label": "4th Year University Projects" },
    { "id": "third-year", "label": "3rd Year University Projects" },
    { "id": "second-year", "label": "2nd Year University Projects" },
    { "id": "first-year", "label": "1st Year University Projects" },
    { "id": "internships", "label": "Internships & Hackathons Projects" },
    { "id": "pre-university", "label": "Pre-University Projects" }
  ],
  "sections": [
    {
      "id": "fourth-year",
      "title": "4th Year University Projects",
      "projects": [
        {
          "title": "Individual Project: Enhancing Puzzle-Solving with User-Tailored AI Assistance: A Study on Nonogram Learning Outcomes",
          "description": "The study explored how AI assistants can be applied in educational settings to improve learning a new puzzle-solving skill. It used a simple control environment (Nonogram puzzle game developed in Unity) to investigate how to tailor an LLM (Meta's Llama 3 8b Instruct) through prompt engineering, without requiring further training, in order to provide personalised help based on the user's in-game progress and thought-process when solving the puzzles.",
          "technologies": [
            "Unity",
            "Python",
            "Meta Llama 3",
            "Machine Learning",
            "Educational AI"
          ],
          "images": [
            "Nonogram_AIAssistant_ArchitecturePipeline.png",
            "Nonogram_AIAssistant_LogicPipeline.png"
          ],
          "links": [
            {
              "text": "View AI Assistant Code",
              "url": "https://github.com/neagualexa/LLM-nonogram-assistant",
              "type": "github"
            },
            {
              "text": "View Unity Nonogram Game Code",
              "url": "https://github.com/neagualexa/NonogramUnity",
              "type": "github"
            }
          ],
          "resources": [
            {
              "text": "MEng Thesis",
              "url": "AI_Assisted_Learning_report.pdf"
            }
          ]
        },
        {
          "title": "Group Project: Avatour - VR-mediated Robot Telepresence System for Exploration of the Real World",
          "description": "This project explored the integration of VR technology into remote robotic telepresence, envisioning a scenario where individuals can explore any real-world location, whether due to health constraints or financial limitations. We used a 360-degree camera mounted on a legged manipulator (Boston Dynamics SPOT) to enable the interactive exploration of a remote human-populated environment. We hypothesised that the 360-degree VR user interface will increase immersion and trust by enabling interactivity and adaptability to different remote scenarios in contrast to traditional 2D interfaces.",
          "technologies": [
            "VR",
            "Boston Dynamics SPOT",
            "360-degree Camera",
            "Robotics",
            "Telepresence"
          ],
          "images": ["Spot_robot_photo.jpeg"],
          "videos": ["Spot_presentation_video.mp4"],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/orgs/HCR-Avatour/repositories",
              "type": "github"
            }
          ],
          "resources": [
            {
              "text": "Project Report",
              "url": "SpotVRTelepresence_report.pdf"
            }
          ]
        }
      ]
    },
    {
      "id": "third-year",
      "title": "3rd Year University Projects",
      "projects": [
        {
          "title": "CharKey - Synthesizer Project",
          "description": "This coursework built a synthesizer on an STM32 Microcontroller connected to a StackSynth keyboard. The finalized synthesizer supports polyphony, different waveforms, different octaves, connecting a synth to other synths using CAN and a 44.1kHz sampling frequency.",
          "technologies": [
            "STM32",
            "Embedded Systems",
            "CAN Bus",
            "Audio Processing",
            "C++"
          ],
          "images": [
            "Synthesiser_clarinet_wave.jpg",
            "Synthesiser_octaves.jpg"
          ],
          "videos": [
            "Synthesiser_demo_video.mp4",
            "Synthesiser_songs_video.mp4"
          ],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/L2R3/charIOT-Key-C",
              "type": "github"
            }
          ]
        },
        {
          "title": "CharIoT",
          "description": "CharIOT is an embedded system containing IoT devices based on Raspberry Pi. The goal of CharIOT is to monitor the quality and reliability of a research space, such as a cleanroom for microchip design. The repo contains the web platform where the users can monitor the readings from the devices through multiple dashboards and live warning animations. The user can set specific expected settings for each specific device, considering that they could be positioned in set locations in the cleanroom and require specific accepted measurement ranges.",
          "technologies": [
            "IoT",
            "Device Communication",
            "Embedded Systems",
            "Protocols"
          ],
          "images": [
            "CharIOT_ArchitecturePipeline.png",
            "CharIOT_product_photo.png"
          ],
          "links": [
            {
              "text": "Web platform repo",
              "url": "https://github.com/neagualexa/charIOT-Web",
              "type": "github"
            },
            {
              "text": "Hub platform repo (private)",
              "url": "https://github.com/JoachimSand/charIOT-Hub",
              "type": "github"
            }
          ]
        },
        {
          "title": "Self-Localising Robot",
          "description": "This project involved making use of one ultrasonic sensor to build a probabilistic localisation algorithm for a rover to keep track of its possible position in an arena. We used Monte Carlo Localisation and took inspiration from ideologies of SLAM to build the algorithms.",
          "technologies": [
            "Robotics",
            "Probabilistic Algorithms",
            "Ultrasonic Sensors",
            "Localisation"
          ],
          "images": ["Localising_robot_profile.jpg"],
          "videos": ["Localising_robot_arena_demo.mp4"],
          "links": [
            {
              "text": "View on Github",
              "url": "https://github.com/DoC-Robotics/Control",
              "type": "github"
            }
          ]
        }
      ]
    },
    {
      "id": "second-year",
      "title": "2nd Year University Projects",
      "projects": [
        {
          "title": "Instability Rover",
          "description": "This project's goal was to build a Mars rover with the aim of mapping an undiscovered arena, identifying and locating the aliens, obstacles, and underground structures in its course. The rover must be able to avoid these obstacles and get back on track without getting derailed from its course. I was in charge of setting up the data transmission and visualisation. Live information regarding the position and status of the rover needs to be transmitted securely, while all data can be visualised on a website. This web-page also allows the users to manually send movement commands for the rover to complete. The project also involved a separate power station that the rover returns to when the battery requires charging.",
          "technologies": [
            "Mars Rover",
            "Data Transmission",
            "Web Visualisation",
            "Python",
            "JavaScript"
          ],
          "images": [
            "Instability_rover_profile.png",
            "Instability_ArchitecturePipeline.png",
            "Instability_website_map.png"
          ],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/neagualexa/Instability",
              "type": "github"
            }
          ],
          "resources": [
            {
              "text": "Project Report",
              "url": "Instability_report.pdf"
            }
          ]
        },
        {
          "title": "Medusa I/O",
          "description": "Medusa I/O aimed to modernise the iconic 1980s game snake, expanding its functionality whilst preserving the signature game mechanics. New adapted features include a multiplayer mode, and power-ups such as increased speed or teleportation. Additionally, the Medusa I/O system features DE-10 Lite FPGA boards as a human interfaces, using the accelerometer as an input, and LEDs and 7-segment displays as some of the outputs.",
          "technologies": [
            "Systems Programming",
            "I/O Systems",
            "Data Processing",
            "Performance Optimization"
          ],
          "images": ["Medusa_IO_photo.jpg"],
          "videos": ["Medusa_IO_presentation_video.mp4"],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/InformationProcessing/Medusa_IO",
              "type": "github"
            }
          ],
          "resources": [
            {
              "text": "Project Report",
              "url": "MedusaIO_report.pdf"
            }
          ]
        },
        {
          "title": "C90 to MIPS Compiler",
          "description": "The program read C source code from a file, and write MIPS assembly to another file.",
          "technologies": [
            "C++",
            "MIPS Assembly",
            "Compiler Design",
            "Language Processing"
          ],
          "images": [],
          "links": []
        },
        {
          "title": "Bus-based MIPS CPU",
          "description": "This project involved developing a working synthesisable MIPS-compatible CPU. This CPU interfaces with the world using a memory-mapped bus, which gives it access to memory and other peripherals. The aim was to develop a piece of IP which could be sold and distributed to many clients, allowing them to integrate the CPU into any number of products. As a consequence the emphasis is on producing a production quality CPU with a robust testing process - you should deliver something that you expect to work on any FPGA or ASIC, rather than something that just works on a single device.",
          "technologies": [
            "SystemVerilog",
            "CPU Design",
            "MIPS Architecture",
            "Digital Design"
          ],
          "images": ["CPU_MIPS_datapath.jpg"],
          "links": []
        }
      ]
    },
    {
      "id": "first-year",
      "title": "1st Year University Projects",
      "projects": [
        {
          "title": "AVS Sim - a SPICE-based Circuit Simulator",
          "description": "AVS is a circuit simulator, written in C++, which uses Modified Nodal Analysis (MNA) to perform both DC Operating Point calculations and AC frequency sweeps on a circuit given by the user in the form of a SPICE Netlist. This program is intended to be a general-purpose command-line Circuit Simulator capable of performing AC sweep, and quiescent operating point simulations on any circuit defined in the popular SPICE Netlist format.",
          "technologies": [
            "SPICE",
            "Circuit Simulation",
            "Electronic Design",
            "Analysis Tools"
          ],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/VladiMarinov/avs-sim",
              "type": "github"
            }
          ],
          "resources": [
            {
              "text": "Project Report",
              "url": "CircuitSImulator_report.pdf"
            }
          ]
        }
      ]
    },
    {
      "id": "internships",
      "title": "Internships & Hackathons Projects",
      "projects": [
        {
          "title": "Lazy Browsing Chrome Extension for Agentic-based personalised shopping",
          "description": "An AI assistant that helps you centralise your search for multiple products of same characteristics online. Using <a href='https://github.com/browser-use/browser-use' target='_blank' rel='noopener noreferrer'>browser use</a> for agents that control a chromium tab to interact with and complete the task.",
          "technologies": [
            "Chrome Extension",
            "AI Agents",
            "Personalization",
            "JavaScript"
          ],
          "images": [],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/neagualexa/ichack25_lazy_browsing",
              "type": "github"
            }
          ]
        },
        {
          "title": "Lazy Browsing Chrome Extension for Agentic-based personalised shopping",
          "description": "An AI assistant that helps you centralise your search for multiple products of same characteristics online. Using <a href='https://github.com/browser-use/browser-use' target='_blank' rel='noopener noreferrer'>browser use</a> for agents that control a chromium tab to interact with and complete the task.",
          "technologies": [
            "Chrome Extension",
            "AI Agents",
            "Personalization",
            "JavaScript"
          ],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/neagualexa/ichack25_lazy_browsing",
              "type": "github"
            }
          ]
        },
        {
          "title": "Monitoring and Alarming System of global EC2 Instance Fleet, AWS",
          "description": "I set up a Monitoring and Alarming System for the largely scalable EC2 Instance Fleet of the <strong>Managed Environments for Outside Work</strong>, a fully managed virtual desktop service.<br><br>I built a cloud infrastructure for fetching, preparing, and visualising device metrics including:<br><ul><li>CPU Utilisation</li><li>RAM Usage</li><li>Network Performance</li><li>Disk Utilisation</li></ul><br>The system is easily deployed through <strong>AWS CDK</strong>, an Infrastructure as Code toolkit, that allows for easy resource provisioning for cloud solutions. The architecture diagram presented is the final infrastructure of the Monitoring and Alarming System.",
          "technologies": ["AWS", "EC2", "Monitoring", "Cloud Infrastructure"],
          "images": ["AWS_MEOW_PlacementProject_ArchitecturePipeline.jpg"],
          "links": []
        },
        {
          "title": "Serverless Infrastructure for a Text to Speech Conversion, AWS",
          "description": "I built a serverless infrastructure for a text to speech conversion and generation system of natural voices using AWS Polly. The backend infrastructure was built using Terraform, an Infrastructure-as-Code tool, that allows for easy resource provisioning for cloud solutions. I set up a web interface using React Typescript to allow users to access the backend functionalities without accessing the AWS console. The architecture diagram presented is the final infrastructure of the backend infrastrucutre. And the Screenshot here is the form webapp for accessing the system.",
          "technologies": [
            "AWS Polly",
            "Serverless",
            "AWS Amplify",
            "Text-to-Speech"
          ],
          "images": [
            "AWS_Polly_PlacementProject_ArchitecturePipeline.jpg",
            "AWS_Polly_PlacementProject_WebApp.png"
          ],
          "links": []
        },
        {
          "title": "Fan Mail Digitalization, AWS Interns Hackathon",
          "description": "My team built a serverless infrastructure for digitalizing fan letters. The uploaded photos and tweets would be translated and filtered considering the comprehended sentiment (blocking negative ones). This way we can centrally display messages in concert venues without the risk of encountering spam or hate speech. The architecture diagram presented is the MVP's infrastructure of the system.",
          "technologies": [
            "AWS",
            "Serverless",
            "NLP",
            "Sentiment Analysis",
            "Translation"
          ],
          "images": ["AWS_FanMailHackathon_ArchitecturePipeline.png"],
          "links": []
        },
        {
          "title": "Online Landing Zone Assessment, AWS",
          "description": "I transferred the Landing Zone Assessment Offering onto the AWS Assessment Tool (A2T tool) and created my own WebApp Demo for the Assessment with AWS Amplify and other services. The architecture diagram presented is the final infrastructure of my WebApp interpretation.",
          "technologies": [
            "AWS",
            "AWS Amplify",
            "Assessment Tools",
            "Cloud Migration"
          ],
          "images": ["AWS_LZAProject_ArchitecturePipeline.png"],
          "links": []
        },
        {
          "title": "ZeroToOne - AR/VR Circuit Design Simulator, ICL ICHack",
          "description": "Aim of the idea was to create a demo for an AR circuit studio, developed in Unity with Vuforia and C#. We used both a Phone compatible headset and the direct phone screen for user interfaces. The android application was presenting a step by step guide for building a specific circuit. This project was aimed for professors to give out remote guidance to students during their hardware laboratories. All models of the circuit components were designed by the team.",
          "technologies": ["AR/VR", "Unity", "C#", "Circuit Design"],
          "images": [
            "ICHack_AR_demo1.jpg",
            "ICHack_AR_demo2.jpg",
            "ICHack_AR_glasses_view.jpeg",
            "ICHack_live_demo_photo.jpeg"
          ],
          "links": []
        },
        {
          "title": "Team projects at Hack-her-thon, ICL WSET",
          "description": "<strong>C-case (2022):</strong><br>An only-girls team project aimed to provide a centralised platform where aid and offers of support to the Ukrainian refugees can be coordinated. The application could connect individuals in need of help with those who able and willing to provide it. It also provided an easy way of accessing donation sites and getting involved as volunteers.<br><br><strong>Solar car (2021):</strong><br>An only-girls team project aimed to teach children the importance of solar energy for the technological development through a web-game quiz with a hardware joystick and solar panel. I held the position of team leader, analysed members' skills and assigned team roles respectively. I improved my understanding of IoT programming hosting an HTML website by the Arduino.",
          "technologies": ["Hackathon", "Women in Tech"],
          "images": ["WSET_hackherthon_logo.png"],
          "links": [
            {
              "text": "C-Case on GitHub",
              "url": "https://github.com/neagualexa/C-Case",
              "type": "github"
            },
            {
              "text": "Solar car on GitHub",
              "url": "https://github.com/neagualexa/Solar-car---Hack-her-thon",
              "type": "github"
            }
          ]
        }
      ]
    },
    {
      "id": "pre-university",
      "title": "Pre-University Projects",
      "projects": [
        {
          "title": "\"QuestZone\" Social Entrepreneurship Personal Project",
          "description": "QuestZone is an online platform which provides refugees and homeless people in the UK with the opportunity of getting temporarily employed for completing simple tasks that do not require a high degree of education. I developed new coding skills in React Native, learned the stages of starting and maintaining a social entrepreneurship idea.<br><br>See pitch <a href='https://youtu.be/qsXfJahGp8w' target='_blank' rel='noopener noreferrer'>here</a>.",
          "technologies": [
            "Social Entrepreneurship",
            "Community Engagement",
            "Project Management",
            "Innovation"
          ],
          "links": [
            {
              "text": "View on GitHub",
              "url": "https://github.com/neagualexa/QuestZone",
              "type": "github"
            }
          ]
        },
        {
          "title": "UK Space Design Competition, Regional & National Stages",
          "description": "Participated in the UK Space Design Competition, advancing through regional to national stages. The project aims were:<br><br><strong>Regional stage:</strong> designing a solution to house 4000 people under the ice of Jupiter's moon, Europa, in the year 2118.<br><br><strong>National stage:</strong> designing an economic and touristic port orbiting the Moon.<br><br>I was the team leader for the Automation Team who oversaw the setting up, usage and maintenance of the building robots, the networking system, and the security & cybersecurity on the base. I was chosen as Reserve to represent the UK at the International Space Settlement Design Competition <a href='https://uksdc.org/2019/03/team-selected-from-the-winning-competition-to-represent-the-uk-at-the-issdc/' target='_blank' rel='noopener noreferrer'>(link)</a>.",
          "technologies": [
            "Space Engineering",
            "Mission Design",
            "Competition",
            "Team Collaboration"
          ],
          "images": ["UKSDC_logo.png"],
          "links": [
            {
              "text": "View UKSDC Finals 2019 Programme",
              "url": "https://uksdc.org/2019/03/2019-uksdc-finals-programme-book/"
            }
          ]
        },
        {
          "title": "Team projects at Coolest Projects International",
          "description": "<strong>2018 - Second World:</strong><br>I was awarded Runner Up prize, Category Games & Web games for the project \"Second World\", a modded Minecraft server aiming to teach children the value of money through a currency ranking system. Developed the various game logistics and mods in Java.<br><br><strong>2017 - Smart house:</strong><br>I completed the project \"Smart house\", aiming to improve homes with self-closing curtains, sound-driven lights and magnetic-based safety door locks and control the equipment on an application. Developed the hardware-software interconnectivity with Arduino, thus integrating IoT ideologies into the implementation of our team's ideas.<br><br><strong>2016 - Warehouse 2.0:</strong><br>I was awarded Enterprise and Evolution awards for the project \"Warehouse 2.0\", a smart hardware solution for storing objects securely, in an organised manner with an application for maintaining the status of the inventory and for warning against theft with specific inventory and location details. Developed the warehouse's hardware system in Arduino. Shaped my first perspective of human-machine interaction and helped shape my fundamental project management and programming skills.",
          "technologies": ["Young Developers"],
          "images": ["CoolestProjects_CoderDojo_logo.png"],
          "links": []
        }
      ]
    }
  ]
}
